Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/atdf/PIC32MZ0512EFK100.atdf
      <value-group caption="Channel Source Pointer bits" name="DCH4SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the source" name="" value="0x1"/>
         <value caption="Points to byte 0 of the source" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH5SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the source" name="" value="0x1"/>
         <value caption="Points to byte 0 of the source" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH6SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the source" name="" value="0x1"/>
         <value caption="Points to byte 0 of the source" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Source Pointer bits" name="DCH7SPTR__CHSPTR">
         <value caption="Points to byte 65535 of the source" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the source" name="" value="0x1"/>
         <value caption="Points to byte 0 of the source" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH0DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the destination" name="" value="0x1"/>
         <value caption="Points to byte 0 of the destination" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH1DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the destination" name="" value="0x1"/>
         <value caption="Points to byte 0 of the destination" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH2DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the destination" name="" value="0x1"/>
         <value caption="Points to byte 0 of the destination" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH3DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the destination" name="" value="0x1"/>
         <value caption="Points to byte 0 of the destination" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH4DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the destination" name="" value="0x1"/>
         <value caption="Points to byte 0 of the destination" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH5DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the destination" name="" value="0x1"/>
         <value caption="Points to byte 0 of the destination" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH6DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the destination" name="" value="0x1"/>
         <value caption="Points to byte 0 of the destination" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Destination Pointer bits" name="DCH7DPTR__CHDPTR">
         <value caption="Points to byte 65535 of the destination" name="" value="0xffff"/>
         <value caption="Points to byte 1 of the destination" name="" value="0x1"/>
         <value caption="Points to byte 0 of the destination" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH0CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff"/>
         <value caption="2 bytes transferred on an event" name="" value="0x2"/>
         <value caption="1 byte transferred on an event" name="" value="0x1"/>
         <value caption="65536 bytes transferred on an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH1CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff"/>
         <value caption="2 bytes transferred on an event" name="" value="0x2"/>
         <value caption="1 byte transferred on an event" name="" value="0x1"/>
         <value caption="65536 bytes transferred on an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH2CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff"/>
         <value caption="2 bytes transferred on an event" name="" value="0x2"/>
         <value caption="1 byte transferred on an event" name="" value="0x1"/>
         <value caption="65536 bytes transferred on an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH3CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff"/>
         <value caption="2 bytes transferred on an event" name="" value="0x2"/>
         <value caption="1 byte transferred on an event" name="" value="0x1"/>
         <value caption="65536 bytes transferred on an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH4CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff"/>
         <value caption="2 bytes transferred on an event" name="" value="0x2"/>
         <value caption="1 byte transferred on an event" name="" value="0x1"/>
         <value caption="65536 bytes transferred on an event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Channel Cell-Size bits" name="DCH5CSIZ__CHCSIZ">
         <value caption="65535 bytes transferred on an event" name="" value="0xffff"/>
         <value caption="2 bytes transferred on an event" name="" value="0x2"/>
         <value caption="1 byte transferred on an event" name="" value="0x1"/>
         <value caption="65536 bytes transferred on an event" name="" value="0x0"/>
      </value-group>
