Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/atdf/PIC32MZ0512EFK100.atdf
         <register caption="Interrupt Enable Control Registe" name="IEC5" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="I2C3BIE"/>
            <bitfield mask="0x00000002" name="I2C3SIE"/>
            <bitfield mask="0x00000004" name="I2C3MIE"/>
            <bitfield mask="0x00000008" name="SPI4EIE"/>
            <bitfield mask="0x00000010" name="SPI4RXIE"/>
            <bitfield mask="0x00000020" name="SPI4TXIE"/>
            <bitfield mask="0x00000040" name="RTCCIE"/>
            <bitfield mask="0x00000080" name="FCEIE"/>
            <bitfield mask="0x00000100" name="PREIE"/>
            <bitfield mask="0x00000200" name="SQI1IE"/>
            <bitfield mask="0x00000400" name="U4EIE"/>
            <bitfield mask="0x00000800" name="U4RXIE"/>
            <bitfield mask="0x00001000" name="U4TXIE"/>
            <bitfield mask="0x00002000" name="I2C4BIE"/>
            <bitfield mask="0x00004000" name="I2C4SIE"/>
            <bitfield mask="0x00008000" name="I2C4MIE"/>
            <bitfield mask="0x00010000" name="SPI5EIE"/>
            <bitfield mask="0x00020000" name="SPI5RXIE"/>
            <bitfield mask="0x00040000" name="SPI5TXIE"/>
            <bitfield mask="0x00080000" name="U5EIE"/>
            <bitfield mask="0x00100000" name="U5RXIE"/>
            <bitfield mask="0x00200000" name="U5TXIE"/>
            <bitfield mask="0x00400000" name="I2C5BIE"/>
            <bitfield mask="0x00800000" name="I2C5SIE"/>
            <bitfield mask="0x01000000" name="I2C5MIE"/>
            <bitfield mask="0x02000000" name="SPI6IE"/>
            <bitfield mask="0x04000000" name="SPI6RXIE"/>
            <bitfield mask="0x08000000" name="SPI6TXIE"/>
            <bitfield mask="0x10000000" name="U6EIE"/>
            <bitfield mask="0x20000000" name="U6RXIE"/>
            <bitfield mask="0x40000000" name="U6TXIE"/>
         </register>
         <register caption="Interrupt Enable Control Registe" name="IEC6" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="ADCEOSIE"/>
            <bitfield mask="0x00000002" name="ADCARDYIE"/>
            <bitfield mask="0x00000004" name="ADCURDYIE"/>
            <bitfield mask="0x00000010" name="ADCGRPIE"/>
            <bitfield mask="0x00000040" name="ADC0EIE"/>
            <bitfield mask="0x00000080" name="ADC1EIE"/>
            <bitfield mask="0x00000100" name="ADC2EIE"/>
            <bitfield mask="0x00000200" name="ADC3EIE"/>
            <bitfield mask="0x00000400" name="ADC4EIE"/>
            <bitfield mask="0x00002000" name="ADC7EIE"/>
            <bitfield mask="0x00004000" name="ADC0WIE"/>
            <bitfield mask="0x00008000" name="ADC1WIE"/>
            <bitfield mask="0x00010000" name="ADC2WIE"/>
            <bitfield mask="0x00020000" name="ADC3WIE"/>
            <bitfield mask="0x00040000" name="ADC4WIE"/>
            <bitfield mask="0x00200000" name="ADC7WIE"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC0" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CTIS"/>
            <bitfield mask="0x0000001C" name="CTIP"/>
            <bitfield mask="0x00000300" name="CS0IS"/>
            <bitfield mask="0x00001C00" name="CS0IP"/>
            <bitfield mask="0x00030000" name="CS1IS"/>
            <bitfield mask="0x001C0000" name="CS1IP"/>
            <bitfield mask="0x03000000" name="INT0IS"/>
            <bitfield mask="0x1C000000" name="INT0IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC1" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T1IS"/>
            <bitfield mask="0x0000001C" name="T1IP"/>
            <bitfield mask="0x00000300" name="IC1EIS"/>
            <bitfield mask="0x00001C00" name="IC1EIP"/>
            <bitfield mask="0x00030000" name="IC1IS"/>
            <bitfield mask="0x001C0000" name="IC1IP"/>
            <bitfield mask="0x03000000" name="OC1IS"/>
            <bitfield mask="0x1C000000" name="OC1IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC2" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x00000003" name="INT1IS"/>
            <bitfield mask="0x0000001C" name="INT1IP"/>
            <bitfield mask="0x00000300" name="T2IS"/>
            <bitfield mask="0x00001C00" name="T2IP"/>
            <bitfield mask="0x00030000" name="IC2EIS"/>
            <bitfield mask="0x001C0000" name="IC2EIP"/>
            <bitfield mask="0x03000000" name="IC2IS"/>
            <bitfield mask="0x1C000000" name="IC2IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC3" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x00000003" name="OC2IS"/>
            <bitfield mask="0x0000001C" name="OC2IP"/>
            <bitfield mask="0x00000300" name="INT2IS"/>
            <bitfield mask="0x00001C00" name="INT2IP"/>
            <bitfield mask="0x00030000" name="T3IS"/>
            <bitfield mask="0x001C0000" name="T3IP"/>
            <bitfield mask="0x03000000" name="IC3EIS"/>
            <bitfield mask="0x1C000000" name="IC3EIP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC4" offset="0x180" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC3IS"/>
            <bitfield mask="0x0000001C" name="IC3IP"/>
            <bitfield mask="0x00000300" name="OC3IS"/>
            <bitfield mask="0x00001C00" name="OC3IP"/>
            <bitfield mask="0x00030000" name="INT3IS"/>
            <bitfield mask="0x001C0000" name="INT3IP"/>
            <bitfield mask="0x03000000" name="T4IS"/>
            <bitfield mask="0x1C000000" name="T4IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC5" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC4EIS"/>
            <bitfield mask="0x0000001C" name="IC4EIP"/>
            <bitfield mask="0x00000300" name="IC4IS"/>
            <bitfield mask="0x00001C00" name="IC4IP"/>
            <bitfield mask="0x00030000" name="OC4IS"/>
            <bitfield mask="0x001C0000" name="OC4IP"/>
            <bitfield mask="0x03000000" name="INT4IS"/>
            <bitfield mask="0x1C000000" name="INT4IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC6" offset="0x1a0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T5IS"/>
            <bitfield mask="0x0000001C" name="T5IP"/>
            <bitfield mask="0x00000300" name="IC5EIS"/>
            <bitfield mask="0x00001C00" name="IC5EIP"/>
            <bitfield mask="0x00030000" name="IC5IS"/>
            <bitfield mask="0x001C0000" name="IC5IP"/>
            <bitfield mask="0x03000000" name="OC5IS"/>
            <bitfield mask="0x1C000000" name="OC5IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC7" offset="0x1b0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T6IS"/>
            <bitfield mask="0x0000001C" name="T6IP"/>
            <bitfield mask="0x00000300" name="IC6EIS"/>
            <bitfield mask="0x00001C00" name="IC6EIP"/>
            <bitfield mask="0x00030000" name="IC6IS"/>
            <bitfield mask="0x001C0000" name="IC6IP"/>
            <bitfield mask="0x03000000" name="OC6IS"/>
            <bitfield mask="0x1C000000" name="OC6IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC8" offset="0x1c0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T7IS"/>
            <bitfield mask="0x0000001C" name="T7IP"/>
            <bitfield mask="0x00000300" name="IC7EIS"/>
            <bitfield mask="0x00001C00" name="IC7EIP"/>
            <bitfield mask="0x00030000" name="IC7IS"/>
            <bitfield mask="0x001C0000" name="IC7IP"/>
            <bitfield mask="0x03000000" name="OC7IS"/>
            <bitfield mask="0x1C000000" name="OC7IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC9" offset="0x1d0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T8IS"/>
            <bitfield mask="0x0000001C" name="T8IP"/>
            <bitfield mask="0x00000300" name="IC8EIS"/>
            <bitfield mask="0x00001C00" name="IC8EIP"/>
            <bitfield mask="0x00030000" name="IC8IS"/>
            <bitfield mask="0x001C0000" name="IC8IP"/>
            <bitfield mask="0x03000000" name="OC8IS"/>
            <bitfield mask="0x1C000000" name="OC8IP"/>
         </register>
         <register caption="Interrupt Priority Control Registe" name="IPC10" offset="0x1e0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T9IS"/>
            <bitfield mask="0x0000001C" name="T9IP"/>
            <bitfield mask="0x00000300" name="IC9EIS"/>
            <bitfield mask="0x00001C00" name="IC9EIP"/>
            <bitfield mask="0x00030000" name="IC9IS"/>
            <bitfield mask="0x001C0000" name="IC9IP"/>
            <bitfield mask="0x03000000" name="OC9IS"/>
            <bitfield mask="0x1C000000" name="OC9IP"/>
         </register>
