Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.58/atdf/PIC32MZ0512EFK100.atdf
      <value-group caption="Region Size bits" name="SBT3REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT3REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT3REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT3REG1__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT3REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT3REG2__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT4REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT4REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT4REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT4REG2__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT5REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT5REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT5REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT5REG1__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT5REG2__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT5REG2__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT6REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT6REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT6REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT6REG1__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT7REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT7REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT7REG1__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT7REG1__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
      <value-group caption="Region Size bits" name="SBT8REG0__SIZE">
         <value caption="Region is not present" name="" value="0x0"/>
         <value caption="Region is 1024 bytes" name="" value="0x1"/>
         <value caption="Region is 2048 bytes" name="" value="0x2"/>
         <value caption="Region is 4096 bytes" name="" value="0x3"/>
      </value-group>
      <value-group caption="Region Priority Level bit" name="SBT8REG0__PRI">
         <value caption="Level 2" name="" value="0x1"/>
         <value caption="Level 1" name="" value="0x0"/>
      </value-group>
